import React from "react";

const OurStory = () => {
  return (
    <section id="ourStory" className="bg-[#f5f5f5] py-20 px-2 md:px-5">
      <div className="container">
        {/* Text Section */}
        <div>
          <h1 className="text-5xl font-medium text-[#111] mb-2">
            Наша история. Уникальный путь.
          </h1>
          <hr className="max-w-[90px] border-[1.5px] mb-4 rounded-2xl border-[#df6500]" />
          <h2 className="text-3xl text-[#df6500] font-medium ">
            Идём своим путём с 2016 года
          </h2>
          <p className="text-md text-[#08162bce] leading-relaxed mt-6">
            Мы — не просто завод по производству строительных панелей, мы —
            основа современного строительства. С самого начала нашей
            деятельности в 2016 году мы стремились к инновациям, качеству и
            надёжности. Каждая панель, произведённая на нашем заводе, проходит
            строгий контроль качества. Мы используем только сертифицированные
            материалы, соответствующие международным стандартам.
          </p>

          <p className="text-md text-[#08162bce] leading-relaxed mt-6">
            Наш завод оснащён современным оборудованием, позволяющим производить
            панели любых размеров и характеристик в кратчайшие сроки. Мы
            обслуживаем как крупные строительные компании, так и частных
            застройщиков. Каждая панель, произведённая на нашем заводе, проходит
            строгий контроль качества. Мы используем только сертифицированные
            материалы, соответствующие международным стандартам.
          </p>

          <p className="text-md text-[#08162bce] leading-relaxed mt-6">
            Каждая панель, произведённая на нашем заводе, проходит строгий
            контроль качества. Мы используем только сертифицированные материалы,
            соответствующие международным стандартам. Сегодня нас выбирают за
            надёжность, точность и честный подход. Мы гордимся тем, что
            участвуем в создании зданий, которые служат десятилетиями.
          </p>

          <p className="text-md text-[#08162bce] leading-relaxed mt-6">
            Сегодня нас выбирают за надёжность, точность и честный подход. Мы
            гордимся тем, что участвуем в создании зданий, которые служат
            десятилетиями. Наш завод оснащён современным оборудованием,
            позволяющим производить панели любых размеров и характеристик в
            кратчайшие сроки. Мы обслуживаем как крупные строительные компании,
            так и частных застройщиков.
          </p>
        </div>
      </div>
    </section>
  );
};

export default OurStory;
