import React from "react";

function Footer() {
  return (
    <footer className="bg-black text-white p-10">
      Каждая панель, произведённая на нашем заводе, проходит строгий контроль
      качества. Мы используем только сертифицированные материалы,
      соответствующие международным стандартам. Сегодня нас выбирают за
      надёжность, точность и честный подход. Мы гордимся тем, что участвуем в
      создании зданий, которые служат десятилетиями. Каждая панель,
      произведённая на нашем заводе, проходит строгий контроль качества. Мы
      используем только сертифицированные материалы, соответствующие
      международным стандартам. Сегодня нас выбирают за надёжность, точность и
      честный подход. Мы гордимся тем, что участвуем в создании зданий, которые
      служат десятилетиями. Каждая панель, произведённая на нашем заводе,
      проходит строгий контроль качества. Мы используем только сертифицированные
      материалы, соответствующие международным стандартам. Сегодня нас выбирают
      за надёжность, точность и честный подход. Мы гордимся тем, что участвуем в
      создании зданий, которые служат десятилетиями.
    </footer>
  );
}

export default Footer;
